import type { DefaultTheme } from 'vitepress'

const sidebarIsland: DefaultTheme.SidebarGroup = {
  text: '《小岛经济学》',
  items: [
    { text: '30天读懂《小岛经济学》', link: '/《小岛经济学》/docs/30天读懂《小岛经济学》' },
    { text: '《小岛经济学》｜ 第一天', link: '/《小岛经济学》/docs/30天读懂《小岛经济学》｜ 第一天' },
    { text: '《小岛经济学》｜第一天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第一天答案' },
    { text: '《小岛经济学》｜ 第2天', link: '/《小岛经济学》/docs/30天读懂《小岛经济学》｜ 第2天' },
    { text: '《小岛经济学》｜第2天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第2天答案' },
    { text: '《小岛经济学》｜ 第3天', link: '/《小岛经济学》/docs/《小岛经济学》｜第3天' },
    { text: '《小岛经济学》｜第3天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第3天答案' },
    { text: '《小岛经济学》｜ 第4天', link: '/《小岛经济学》/docs/《小岛经济学》｜第4天' },
    { text: '《小岛经济学》｜第4天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第4天答案' },
    { text: '《小岛经济学》｜ 第5天', link: '/《小岛经济学》/docs/《小岛经济学》｜第5天' },
    { text: '《小岛经济学》｜第5天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第5天答案' },
    { text: '《小岛经济学》 第一周总结', link: '/《小岛经济学》/docs/30天读《小岛经济学》 第一周总结' },
    { text: '《小岛经济学》｜第二周预告', link: '/《小岛经济学》/docs/30天读《小岛经济学》｜第二周' },
    { text: '《小岛经济学》｜第6天', link: '/《小岛经济学》/docs/《小岛经济学》｜第6天' },
    { text: '《小岛经济学》｜第6天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第6天答案' },
  ],
}

export default sidebarIsland
