import type { DefaultTheme } from 'vitepress'

const sidebarIsland: DefaultTheme.SidebarGroup = {
  text: '《小岛经济学》',
  items: [
    // 概览
    { text: '30天读懂《小岛经济学》', link: '/《小岛经济学》/docs/30天读懂《小岛经济学》' },
    // 第一周
    { text: '《小岛经济学》｜ 第一天', link: '/《小岛经济学》/docs/30天读懂《小岛经济学》｜ 第一天' },
    { text: '《小岛经济学》｜第一天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第一天答案' },
    { text: '《小岛经济学》｜ 第2天', link: '/《小岛经济学》/docs/30天读懂《小岛经济学》｜ 第2天' },
    { text: '《小岛经济学》｜第2天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第2天答案' },
    { text: '《小岛经济学》｜第3天', link: '/《小岛经济学》/docs/《小岛经济学》｜第3天' },
    { text: '《小岛经济学》｜第3天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第3天答案' },
    { text: '《小岛经济学》｜第4天', link: '/《小岛经济学》/docs/《小岛经济学》｜第4天' },
    { text: '《小岛经济学》｜第4天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第4天答案' },
    { text: '《小岛经济学》｜第5天', link: '/《小岛经济学》/docs/《小岛经济学》｜第5天' },
    { text: '《小岛经济学》｜第5天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第5天答案' },
    { text: '第一周总结', link: '/《小岛经济学》/docs/30天读《小岛经济学》 第一周总结' },
    // 第二周
    { text: '第二周预告', link: '/《小岛经济学》/docs/30天读《小岛经济学》｜第二周' },
    { text: '《小岛经济学》｜第6天', link: '/《小岛经济学》/docs/《小岛经济学》｜第6天' },
    { text: '《小岛经济学》｜第6天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第6天答案' },
    { text: '《小岛经济学》｜第7天', link: '/《小岛经济学》/docs/《小岛经济学》｜第7天' },
    { text: '《小岛经济学》｜第8天', link: '/《小岛经济学》/docs/《小岛经济学》｜第8天' },
    { text: '《小岛经济学》｜第8天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第8天答案' },
    { text: '《小岛经济学》｜第9天', link: '/《小岛经济学》/docs/《小岛经济学》｜第9天' },
    { text: '《小岛经济学》｜第9天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第9天答案' },
    { text: '《小岛经济学》｜第10天', link: '/《小岛经济学》/docs/《小岛经济学》｜第10天' },
    { text: '《小岛经济学》｜第10天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第10天答案' },
    { text: '第二周总结', link: '/《小岛经济学》/docs/30天读《小岛经济学》第二周总结' },
    // 第三周
    { text: '第三周预告', link: '/《小岛经济学》/docs/30天读《小岛经济学》｜第三周预告' },
    { text: '《小岛经济学》｜第11天', link: '/《小岛经济学》/docs/《小岛经济学》｜第11天' },
    { text: '《小岛经济学》｜第11天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第11天答案' },
    { text: '《小岛经济学》｜第12天', link: '/《小岛经济学》/docs/《小岛经济学》｜第12天' },
    { text: '《小岛经济学》｜第12天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第12天答案' },
    { text: '《小岛经济学》｜第13天', link: '/《小岛经济学》/docs/《小岛经济学》｜第13天' },
    { text: '《小岛经济学》｜第14天', link: '/《小岛经济学》/docs/《小岛经济学》｜第14天' },
    { text: '《小岛经济学》｜第14天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第14天答案' },
    { text: '《小岛经济学》｜第15天', link: '/《小岛经济学》/docs/《小岛经济学》｜第15天' },
    { text: '《小岛经济学》｜第15天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第15天答案' },
    { text: '第三周总结', link: '/《小岛经济学》/docs/30天读《小岛经济学》第三周总结' },
    // 第四周
    { text: '第四周预告', link: '/《小岛经济学》/docs/30天读《小岛经济学》｜第四周预告' },
    { text: '《小岛经济学》｜第16天', link: '/《小岛经济学》/docs/《小岛经济学》｜第16天' },
    { text: '《小岛经济学》｜第16天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第16天答案' },
    { text: '《小岛经济学》｜第17天', link: '/《小岛经济学》/docs/《小岛经济学》｜第17天' },
    { text: '《小岛经济学》｜第17天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第17天答案' },
    { text: '《小岛经济学》｜第18天', link: '/《小岛经济学》/docs/《小岛经济学》｜第18天' },
    { text: '《小岛经济学》｜第18天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第18天答案' },
    { text: '《小岛经济学》｜第19天', link: '/《小岛经济学》/docs/《小岛经济学》｜第19天' },
    { text: '《小岛经济学》｜第19天答案', link: '/《小岛经济学》/docs/《小岛经济学》｜第19天答案' },
    // 总结
    { text: '30天总结', link: '/《小岛经济学》/docs/《小岛经济学》30天总结' },
  ],
}

export default sidebarIsland
